# Написати гру «Вгадай число». Програма загадує число в діапазоні від 1 до 500.
# Користувач намагається його вгадати. Після кожної спроби програма видає підказки,
# чи його число є більшим або меншим за задумане. У кінці програма видає статистику:
# за скільки спроб угадано число. Передбачити вихід за допомогою 0, у разі, якщо користувачеві набридло вгадувати число.

import random

attempts = 0
number = random.randint(1,500)

print("Гра «Вгадай число»")

while True:
    print("Для виходу з гри натисніть 0")
    user = int(input("Введіть число: "))

    if user == 0:
        print("\033[34m Ви завершили гру \033[0m")
        break
    elif user < number:
        print("\033[32m Введене вами число є менше за створене \033[0m")
        attempts += 1
    elif user > number:
        print("\033[31m Введене вами число є більшим за створене \033[0m")
        attempts += 1
    elif user == number:
        attempts += 1 # без цієї дії при введені 10 спроб буде виведено 9 не враховуючи 10 виграшну
        print(f"\033[33m Ви вгадали число {number} за {attempts} спроб \033[0m")
        break